# Series

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
dic={'a':10,'b':15,'c':20,'d':25}

In [4]:
ser1=pd.Series(dic)

In [5]:
ser1

a    10
b    15
c    20
d    25
dtype: int64

In [6]:
ser1[['a','b']]

a    10
b    15
dtype: int64

In [7]:
ser2=pd.Series([5,2,2,1,9,1])

In [8]:
ser2

0    5
1    2
2    2
3    1
4    9
5    1
dtype: int64

In [9]:
type(ser2)

pandas.core.series.Series

In [10]:
ser2[(ser2%2==0)]

1    2
2    2
dtype: int64

In [11]:
ser2

0    5
1    2
2    2
3    1
4    9
5    1
dtype: int64

# DataFrame

In [12]:
from numpy.random import randn

In [13]:
randn(2,3)

array([[ 1.01957365,  0.75290113, -0.91169215],
       [ 1.19761277,  0.3277981 ,  0.94405606]])

In [14]:
type(randn(2))

numpy.ndarray

In [53]:
df=pd.DataFrame(randn(6,5),['A','B','C','D','E','F'],['Jap','Tim','Bur','Ami','Kio'])

In [54]:
df

        Jap       Tim       Bur       Ami       Kio
A -0.021314 -0.791881 -0.822225  1.302389 -0.809717
B -1.161024  1.456350  2.321638  0.403937  0.792137
C  1.047406 -0.503401  0.871590 -1.300295  0.349428
D  0.649527  0.869084 -0.175512 -0.155641  1.512540
E -0.420978 -1.782464  1.603207  0.588265 -0.293537
F -0.158355  0.176777 -0.471445  0.610953  0.741134

In [17]:
df[['Jap','Bur']]#list of col

        Jap       Bur
A -2.381501  0.389558
B -1.860713 -0.144301
C -1.536860 -0.356959
D  0.041846  0.879043
E  0.446315  0.043841
F -1.544709  0.393766

In [18]:
df.loc['D']

Jap    0.041846
Tim    0.041221
Bur    0.879043
Ami   -0.136958
Kio    1.658089
Name: D, dtype: float64

In [19]:
df.iloc[3:4,:]

        Jap       Tim       Bur       Ami       Kio
D  0.041846  0.041221  0.879043 -0.136958  1.658089

In [20]:
df

        Jap       Tim       Bur       Ami       Kio
A -2.381501 -0.021928  0.389558  2.988773 -0.852427
B -1.860713  0.348965 -0.144301  0.344998  0.166519
C -1.536860 -0.187880 -0.356959 -1.420884 -0.145742
D  0.041846  0.041221  0.879043 -0.136958  1.658089
E  0.446315  0.013434  0.043841  0.459585  1.801134
F -1.544709 -0.672845  0.393766  0.267708 -0.213889

In [21]:
df.shape[1]

5

In [22]:
df.describe()#stats

            Jap       Tim       Bur       Ami       Kio
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean  -1.139270 -0.079839  0.200824  0.417204  0.402280
std    1.122069  0.338795  0.444456  1.437219  1.081084
min   -2.381501 -0.672845 -0.356959 -1.420884 -0.852427
25%   -1.781712 -0.146392 -0.097266 -0.035792 -0.196853
50%   -1.540785 -0.004247  0.216699  0.306353  0.010388
75%   -0.352830  0.034274  0.392714  0.430939  1.285196
max    0.446315  0.348965  0.879043  2.988773  1.801134

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, A to F
Data columns (total 5 columns):
Jap    6 non-null float64
Tim    6 non-null float64
Bur    6 non-null float64
Ami    6 non-null float64
Kio    6 non-null float64
dtypes: float64(5)
memory usage: 448.0+ bytes

In [27]:
df.reset_index(inplace=True)

In [28]:
df

  index       Jap       Tim       Bur       Ami       Kio
0     A -2.381501 -0.021928  0.389558  2.988773 -0.852427
1     B -1.860713  0.348965 -0.144301  0.344998  0.166519
2     C -1.536860 -0.187880 -0.356959 -1.420884 -0.145742
3     D  0.041846  0.041221  0.879043 -0.136958  1.658089
4     E  0.446315  0.013434  0.043841  0.459585  1.801134
5     F -1.544709 -0.672845  0.393766  0.267708 -0.213889

In [29]:
df.set_index('index',inplace=True)

In [30]:
df

            Jap       Tim       Bur       Ami       Kio
index
A     -2.381501 -0.021928  0.389558  2.988773 -0.852427
B     -1.860713  0.348965 -0.144301  0.344998  0.166519
C     -1.536860 -0.187880 -0.356959 -1.420884 -0.145742
D      0.041846  0.041221  0.879043 -0.136958  1.658089
E      0.446315  0.013434  0.043841  0.459585  1.801134
F     -1.544709 -0.672845  0.393766  0.267708 -0.213889

In [32]:
df.loc['A','Jap']

-2.3815011126406036

In [42]:
df[(df>0)].isnull().sum()

Jap    4
Tim    3
Bur    2
Ami    2
Kio    3
dtype: int64

In [44]:
boold=df.loc['C']>0
boold

Jap    False
Tim    False
Bur    False
Ami    False
Kio    False
Name: C, dtype: bool

In [43]:
df

            Jap       Tim       Bur       Ami       Kio
index
A     -2.381501 -0.021928  0.389558  2.988773 -0.852427
B     -1.860713  0.348965 -0.144301  0.344998  0.166519
C     -1.536860 -0.187880 -0.356959 -1.420884 -0.145742
D      0.041846  0.041221  0.879043 -0.136958  1.658089
E      0.446315  0.013434  0.043841  0.459585  1.801134
F     -1.544709 -0.672845  0.393766  0.267708 -0.213889

In [46]:
df[df>0].isnull().any()

Jap    True
Tim    True
Bur    True
Ami    True
Kio    True
dtype: bool

In [55]:
check=df[df>0]
check

        Jap       Tim       Bur       Ami       Kio
A       NaN       NaN       NaN  1.302389       NaN
B       NaN  1.456350  2.321638  0.403937  0.792137
C  1.047406       NaN  0.871590       NaN  0.349428
D  0.649527  0.869084       NaN       NaN  1.512540
E       NaN       NaN  1.603207  0.588265       NaN
F       NaN  0.176777       NaN  0.610953  0.741134

In [59]:
check[check.isnull().any(axis=1)]

        Jap       Tim       Bur       Ami       Kio
A       NaN       NaN       NaN  1.302389       NaN
B       NaN  1.456350  2.321638  0.403937  0.792137
C  1.047406       NaN  0.871590       NaN  0.349428
D  0.649527  0.869084       NaN       NaN  1.512540
E       NaN       NaN  1.603207  0.588265       NaN
F       NaN  0.176777       NaN  0.610953  0.741134